Revit 2026 API

# RebarSpliceTypeUtilsGetAllRebarSpliceTypes Method

---

Gets all the Rebar Splice Types elements from the document.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> GetAllRebarSpliceTypes(
	Document document
)
```
```vb
Public Shared Function GetAllRebarSpliceTypes (
	document As Document
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ GetAllRebarSpliceTypes(
	Document^ document
)
```
```fsharp
static member GetAllRebarSpliceTypes :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
     The document.

#### Return Value

IListElementId Returns all the Rebar Splice Types elements from the document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Internally this function is returning all element ids from a FilteredElementCollector of category BuiltInCategory.OST_RebarSpliceType.

#### Reference

RebarSpliceTypeUtils Class

Autodesk.Revit.DB.Structure Namespace